import torch

### 1.1 Создание тензоров (7 баллов)
# Создайте следующие тензоры:

# - Тензор размером 3x4, заполненный случайными числами от 0 до 1
tensor_random = torch.rand(3, 4)
print(tensor_random)

# - Тензор размером 2x3x4, заполненный нулями
tensor_zero = torch.zeros(2, 3, 4)
print(tensor_zero)

# - Тензор размером 5x5, заполненный единицами
tensor_one = torch.ones(5, 5)
print(tensor_one)

# - Тензор размером 4x4 с числами от 0 до 15 (используйте reshape)
tensor_reshape = torch.arange(0, 16, 1).reshape(4,4)
print(tensor_reshape)
print("------------")

### 1.2 Операции с тензорами (6 баллов)
# Дано: тензор A размером 3x4 и тензор B размером 4x3
# Выполните:
A = torch.arange(0, 12, 1).view(3,4)
B = torch.arange(0, 12, 1).view(4,3)
print(A)
print(B)

# - Транспонирование тензора A
print(A.transpose(0, 1))

# - Матричное умножение A и B
print(A @ B)

# - Поэлементное умножение A и транспонированного B
print(A * B.T)

# - Вычислите сумму всех элементов тензора A
print(A.sum())
print("------------")

### 1.3 Индексация и срезы (6 баллов)
# Создайте тензор размером 5x5x5
# Извлеките:
a = torch.rand(5,5,5)
print(a)

# - Первую строку
print(a[0, :, :])

# - Последний столбец
print(a[:, :, -1])

# - Подматрицу размером 2x2 из центра тензора
print(a[2:4, 2:4, 2:4])

# - Все элементы с четными индексами
print(a[::2, ::2, ::2])
print("------------")

### 1.4 Работа с формами (6 баллов)
# Создайте тензор размером 24 элемента
# Преобразуйте его в формы:
a = torch.arange(0, 24, 1)

# - 2x12
print(a.view(2, 12))

# - 3x8
print(a.view(3, 8))

# - 4x6
print(a.view(4, 6))

# - 2x3x4
print(a.view(2, 3, 4))

# - 2x2x2x3
print(a.view(2, 2, 2, 3))